```tf
Terraform will perform the following actions:
  # google_storage_bucket.test_bucket_202501052228_ex will be created
  + resource "google_storage_bucket" "test_bucket_202501052228_ex" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "test-bucket-202501052228-ex"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
      + soft_delete_policy (known after apply)
      + versioning (known after apply)
      + website (known after apply)
    }
Plan: 1 to add, 0 to change, 0 to destroy.

```